<?php
/**
 * api 相关自定义配置
 *
 * Created by PhpStorm.
 * User: Alex
 * Date: 2020/2/5
 * Time: 2:02
 */

return [

    /*
    |--------------------------------------------------------------------------
    | 接口频率限制
    |--------------------------------------------------------------------------
    |
    */
    'rate_limits' => [
        // 访问频率限制，次数/分钟
        'access' =>  env('RATE_LIMITS', '60,1'),
        // 登录相关，次数/分钟
        'sign' =>  env('SIGN_RATE_LIMITS', '10,1'),
    ],

    /*
    |--------------------------------------------------------------------------
    | 缓存 key
    |--------------------------------------------------------------------------
    |
    */
    'cache_key' => [
        // 缓存过期时间为 24 小时
        'cache_expire' => 1440 * 60,
        // 图片验证码的缓存 key
        'captcha' => 'captcha-',
        // 短信验证码的缓存 key
        'verificationCode' => 'verificationCode_',
        // 站点设置的缓存 key
        'site' => 'site'
    ],

    /*
    |--------------------------------------------------------------------------
    | jwt 相关
    |--------------------------------------------------------------------------
    |
    */
    'custom_jwt' => [
        // 当登录时勾选记住我时，默认 token 有效期设置为 10080 分钟，也就是一星期
        'remember_me_ttl' => env('JWT_REMEMBER_ME_TTL', 10080),
    ],

    /*
    |--------------------------------------------------------------------------
    | 默认使用的权限守卫名称
    |--------------------------------------------------------------------------
    |
    */
    'default_guard_name' => 'admin',


];
